tap "classmethod/repos"
tap "homebrew/bundle"
brew "asdf"
brew "pycparser"
brew "cffi"
brew "docutils"
brew "python@3.11"
brew "awscli"
brew "awscli@1"
brew "bat"
brew "cocoapods"
brew "deno"
brew "duf"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git-secrets"
brew "jq"
brew "libfido2"
brew "licenseplist"
brew "mysql"
brew "openssl@1.1"
brew "peco"
brew "postgresql@15"
brew "pstree"
brew "publish"
brew "swiftlint"
brew "wget"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "classmethod/repos/aurl"
cask "monitorcontrol"
cask "numi"
cask "pusher"
cask "sequel-ace"
cask "wave"
vscode "alefragnani.project-manager"
vscode "almenon.arepl"
vscode "arjun.swagger-viewer"
vscode "batisteo.vscode-django"
vscode "codezombiech.gitignore"
vscode "cstrap.python-snippets"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "deerawan.vscode-dash"
vscode "demystifying-javascript.python-extensions-pack"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "fwcd.kotlin"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "haskell.haskell"
vscode "hbenl.vscode-test-explorer"
vscode "jebbs.plantuml"
vscode "justusadam.language-haskell"
vscode "kaih2o.python-resource-monitor"
vscode "kevinrose.vsc-python-indent"
vscode "littlefoxteam.vscode-python-test-adapter"
vscode "mathiasfrohlich.kotlin"
vscode "mintlify.document"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.test-adapter-converter"
vscode "njpwerner.autodocstring"
vscode "njqdev.vscode-python-typehint"
vscode "octref.vetur"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "shuworks.vscode-table-formatter"
vscode "streetsidesoftware.code-spell-checker"
vscode "svanimpe.stencil"
vscode "thebarkman.vscode-djaneiro"
vscode "trabpukcip.wolf"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "vue.volar"
vscode "xirider.livecode"
vscode "yzhang.markdown-all-in-one"
vscode "ziyasal.vscode-open-in-github"
